[
  {
    "title":"EventLite Co-Founder",
    "repolink":"https://github.com/AmrMahmoud96/Evaquint",
    "mainImage":"images/Evaquint/main.png",
    "images":[{
	     "path":"images/Evaquint/wireframes.png",
	      "caption":"Initial wireframes chosen for the mobile app."
        },{
    	     "path":"images/Evaquint/EvaquintAPIDiagram.png",
    	      "caption":"Backend end points selected and designed for the GoLang RESTful API."
            }],
    "videos":[],
    "url":"",
    "date":"2019-11-01",
    "description":"EventLite, formerly known as Evaquint, is an application I co-founded with the purpose of addressing a major event organization problem I found apparent in my local community. EventLite tackles event organization by providing a platform for participants and hosts to interact over a simplified event-planning process. JWT tokens were implemented to validate users and create a robust user management system through Postgres SQL. A service-oriented approach was selected in order to develop a RESTful API back-end that scales with growing numbers of users, events, and vendors. Adobe XD drafted wireframes/flows showcase design choices that focused on simplistic UI and great UX.",
    "tags":["Go","SQL","Git","Cloud Technologies","RESTful APIs"]
  },
  {
    "title":"Capstone: Alpha Factory",
    "repolink":"https://github.com/AmrMahmoud96/Project-Green",
    "mainImage":"images/Capstone/main.png",
    "images":[{
       "path":"images/Capstone/mainpage.png",
        "caption":"Main page of the Alpha Factory web app."
        },{
            	     "path":"images/Capstone/generator.png",
            	      "caption":"Account creation process: simple questions asked to understand the user's financial goals."
                  },{
              	     "path":"images/Capstone/questions.png",
              	      "caption":"Questionnaire consiting of twenty questions with only two options each; meant to gauge user's risk tolerance."
                  },{
              	     "path":"images/Capstone/result.png",
              	      "caption":"Risk tolerance results from calculating the average of the questionnaires scores. Answers are considered either aggressive or conservative and tallied up to bucket users into one of 5 possible risk levels."
                      },{
                  	     "path":"images/Capstone/dash.png",
                  	      "caption":"User dashboard to monitor portfolio performance, statistics, and allocations."
                          },{
                          	     "path":"images/Capstone/Tearsheet.png",
                          	      "caption":"A sample tearsheet of portfolio performance produced by the Alpha Factory models."
                                  },{
                  	     "path":"images/Capstone/finalflow.png",
                  	      "caption":"Final wireflows detailing the backend and process flows."
                          }],
    "videos":[],
    "url":"http://alphafactory.herokuapp.com/about",
    "date":"2018-09-01",
    "description":"Optimally allocate funds to form a portfolio using a risk-parity model that is based on the user's financial goals and risk tolerance (acquired through an introductory questionnaire). Designed and developed a fully functioning robo-advisor web app for the average retail investor through Flask and Jinja2. Applied financial models and back-testing functions to produce proven and sound portfolios based on user goals and risk tolerance. Deployed the final web application to Heroku and ensured production functionality with the MongoDB database.",
    "tags":["Python","Flask","Git","JavaScript","NoSQL","RESTful APIs"]
  },
  {
    "title":"Autonomous Robot",
    "repolink":"",
    "mainImage":"images/AER201/main.png",
    "images":[{
	     "path":"images/AER201/frame.png",
	      "caption":"Mechanical frame upon which all of the sensors, motors, and payloads are mounted."
        },{
    	     "path":"images/AER201/kill-button.jpg",
    	      "caption":"Top view of robot including kill-button (red square) to stop the function of the robot in emergencies."
            },{
        	     "path":"images/AER201/Robot1.png",
        	      "caption":"Fully complete prototype including a retractable arm that avoids obstacles while reading the water level (white tape strip) of the buckets and reports them autonomously."
                }],
    "videos":["https://www.youtube.com/embed/BAfB_pdHK6U"],
    "url":"",
    "date":"2015-09-01",
    "description":"Designed and built an autonomous robot inspired by a nuclear powerplant’s need to frequent check radioactive waste water levels. As part of the Engineering Science program, AER201 is a course that introduces engineers to real world problems and challenges them to produce a technical solution through programming and innovation. As head of programming and systems integration, I strategically assigned tasks to be completed within a group through the use of Gantt charts and other planning tools and ensured the completion of project deliverables within expected deadlines. Programmed a PIC16F877 microcontroller using Assembly to take input from multiple different sensors and autonomously accomplish the tasks required of the robot. Integrated the circuits and mechanical subsystems while iteratively improving the robot at each checkpoint to exceed project criteria.",
    "tags":[]
  },
  {
    "title":"NSBE Hacks: SafeTag",
    "repolink":"https://github.com/AmrMahmoud96/SafeTag",
    "mainImage":"images/NSBEHacks/main.png",
    "acheivement":"1st Place",
    "images":[{
	     "path":"images/NSBEHacks/presenting.jpeg",
	      "caption":"Presenting to a group of judges from a multitiude of different companies and diverse backgrounds."
        },{
    	     "path":"images/NSBEHacks/Prize.jpeg",
    	      "caption":"First place award picture."
            },{
        	     "path":"images/NSBEHacks/Prize2.jpg",
        	      "caption":"Team posing for the prize picture. (Missing Asseel Sidique)"
                }],
    "videos":["https://www.youtube.com/embed/FHpvpywwj94","https://www.youtube.com/embed/k9_700-KTkY"],
    "url":"https://devpost.com/software/safetag",
    "date":"2019-01-26",
    "description":"Created in 8 hours for the first hackathon hosted by NSBE with over 60 participants. Inspired by the movie Spiderman – Into the Spider-verse, SafeTag is an iOS app that uses AR to create a safe and infinite digital space for street-artists. By utilizing a room-separated VR world, SafeTag allows artists to tag their own unique creations to surfaces all around the world without the risks or drawbacks of physical graffiti. A point to note is that SafeTag was created in limited time but was designed with the intention of expanding it’s usage to a number of real-world applications such as museum downsizing and tourism enabling (through an arts-agram of sorts).",
    "tags":["Git","RESTful APIs","NoSQL","nodeJS"]
  },
  {
    "title":"UofT Hacks: FaceLyft",
    "repolink":"https://github.com/kbop543/FaceLyft",
    "mainImage":"images/UofTHacks/main.png",
    "acheivement":"2nd Place",
    "images":[{
       "path":"images/UofTHacks/fullpresentationroom.jpg",
        "caption":"Hundreds of participants and guests packed into UofT's lecture rooms to see presentations of the top 5 projects."
        },{
           "path":"images/UofTHacks/interac.jpeg",
            "caption":"Interac team posing with the FaceLyft team as winners of Interac's e-Transfer Open API challenge."
            },{
        	     "path":"images/UofTHacks/me.jpg",
        	      "caption":"Demoing the facial recognition payment system with some audience interactivity."
                },{
            	     "path":"images/UofTHacks/prep.jpg",
            	      "caption":"Presentation setup for open house."
                    },{
                	     "path":"images/UofTHacks/presentation-hall.jpeg",
                	      "caption":"Presentation setup (top) and jam packed presentation hall for the hundreds of guests and participants of UofTHacks."
                        },{
                    	     "path":"images/UofTHacks/presenting.jpg",
                    	      "caption":"Answering questions about future plans for the project as well as limitations."
                            },{
                        	     "path":"images/UofTHacks/prize.jpeg",
                        	      "caption":"Winner of the second place prize overall!"
                                },{
                            	     "path":"images/UofTHacks/team.jpeg",
                            	      "caption":"The full FaceLyft team. From left to right: Amr Mahmoud, Lisa Tran, Kyra Simone, Asseel Sidique."
                                    }],
    "videos":["https://www.youtube.com/embed/nXpSHgAcLX0"],
    "url":"https://devpost.com/software/facelyft",
    "date":"2019-01-08",
    "description":"Second place winner of a 36 hour hackathon hosted by UofT and MLH with over 300 participants. FaceLyft is a web app for carpool drivers that provides drivers and riders the tools to make the carpooling experience (and general money transfer experience) seamless. Features facial recognition payment system through IBM Watson AI and interac e-transfer, smart car door lock/unlock via the web app, transaction history, payment status, and vehicle information tracking. Other prizes: Best Hack using Interac e-Transfer Open API, Top 10 Prize (Entrepreneurship Hatchery).",
    "tags":["Git","React","RESTful APIs","Machine Learning","NoSQL","nodeJS"]
  },
  {
    "title":"Ryerson Hacks: Arcangel",
    "repolink":"https://github.com/asidique/ArcAngel",
    "mainImage":"images/RUHacks/main.png",
    "images":[{
       "path":"images/RUHacks/discussion.jpg",
        "caption":"Asseel Sidique discussing ideas and brainstorming with the team."
        },{
           "path":"images/RUHacks/presenting.jpg",
            "caption":"Presenting ArcAngel to a judge."
            },{
               "path":"images/RUHacks/loginpage.png",
                "caption":"Login and landing page when loading up ArcAngel. To access the main site, users are required to scan an RFID card. (see video for demo)"
                },{
               "path":"images/RUHacks/overview.png",
                "caption":"Overview / Main page after logging into ArcAngel"
                },{
                   "path":"images/RUHacks/medical.png",
                    "caption":"Medical information page with past symptoms, diagnosis, and other information."
                    },{
                       "path":"images/RUHacks/appointment.png",
                        "caption":"Appointment page for scheduling and rescheduling meetings with doctors as well as prior meeting history with notes."
                        },{
                           "path":"images/RUHacks/labs.png",
                            "caption":"Lab results page for any tests doctors have requested for you."
                            },{
                               "path":"images/RUHacks/drugs.png",
                                "caption":"Prescription tab to keep track of current medication and important notes on drug information."
                                },{
                                   "path":"images/RUHacks/emergency.png",
                                    "caption":"Emergency contant information as well as medical information for paramedics arriving on scene to an emergency."
                                    }],
    "videos":["https://www.youtube.com/embed/CITZ9O8bc7s","https://www.youtube.com/embed/-rNsIEmY0nU"],
    "url":"",
    "date":"2018-03-30",
    "description":"Project created in 36 hours for a hackathon hosted by Ryerson University and MLH. ArcAngel is an AI tool that provides a soft diagnosis when given a series of symptoms. ArcAngel is built into a medical dashboard that displays patient history, drug prescriptions and information, doctor messages and appointments, lab results, and more.  Features: Speech-to-text, appointment management system, emergency info, RFID (card) access to the website, and current prescription + drug information sheets.",
    "tags":["Git","React","RESTful APIs","Machine Learning","nodeJS","Cloud Technologies","NoSQL"]
  },
  {
    "title":"Mission Hack: BlueChain",
    "repolink":"https://github.com/asidique/Project-Blue",
    "mainImage":"images/MissionHack/main.png",
    "acheivement":"Top Five",
    "images":[],
    "videos":["https://www.youtube.com/embed/8Y1DPuxwB04"],
    "url":"",
    "date":"2018-03-01",
    "description":"One of the top 5 projects created in a 2 day hackathon hosted by Hackworks and Intact. BlueChain is an Ethereum-based marketplace that utilizes Smart Contracts to handle real-time blockchain transactions. Features include loyalty point incentives, warranties and complete purchase history, searching functionality for all products on the network, and secure transactions through smart contracts.",
    "tags":["Git","React","nodeJS"]
  },
  {
    "title":"Citadel Algorithmic Trading Competition ",
    "repolink":"https://github.com/AmrMahmoud96/Citadel-Algo-Contest",
    "mainImage":"images/Citadel/main.png",
    "acheivement":"2nd Place",
    "images":[{
       "path":"images/Citadel/traders.jpg",
        "caption":"A trader looks at the screen to monitor the performance of their algorithm in Rotman's simulated trading environment."
        }],
    "videos":[],
    "url":"",
    "date":"2018-11-01",
    "description":"Second place winner of the Citadel Algorithmic Trading Competition hosted in November 2018. The purpose of the competition was to program a trading algorithm that can produce the highest risk-free (or arbitrage) returns in a simulated trading environment while competing against other trading algorithms. While my algorithm produced the highest overall profit, final rankings were determined by average position across five trial runs.",
    "tags":["Git","Python","RESTful APIs"]
  },
  {
    "title":"UofT Engineering Finance Association Website",
    "repolink":"",
    "mainImage":"images/UTEFA/main.png",
    "images":[{
       "path":"images/UTEFA/homepage.png",
        "caption":"Public home page available to all users first accessing the site."
        },{
           "path":"images/UTEFA/membermain.png",
            "caption":"Member home page displaying important club announcements available to club members after logging into the site."
            },{
               "path":"images/UTEFA/discuss.png",
                "caption":"Discussion board for posting and responding to ongoing discussions within the club."
                },{
                   "path":"images/UTEFA/files.png",
                    "caption":"File viewing page to review and download any club-related materials needed."
                    },{
                       "path":"images/UTEFA/upload.png",
                        "caption":"Admin view: Post page for posting discussions, announcements, votes on portfolio decisions, and club files."
                        }],
    "videos":[],
    "url":"https://www.utefa.com",
    "date":"2018-09-01",
    "description":"A double-sided website I volunteered to help enhance for the University of Toronto Engineering Finance Association (UTEFA). I assisted in the rework of the website to include a member-facing dashboard that displays club activities, reports on portfolio performance, a voting section for portfolio decisions, a section to view club files, and a chat board for posting and responding to posts. As part of the development, I was also tasked with developing to account for admin-user sanctions that include allowing positing of discussion boards, content files, and votes.",
    "tags":["Git","Cloud Technologies","React","RESTful APIs","NoSQL","nodeJS"]
  }
]
